backend/app/controllers/card_controller.rb

    def aiDeck
        cards = []
        while(cards.length < 20)
            card = Card.all.sample
---
SELECT "cards".* FROM "cards"