backend/app/controllers/user_card_controller.rb

    def index
        user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        user = User.find(params[:user_id])
        # card = user.user_cards.find{ |uCard| uCard.card.id == params[:card_id]}
        user_cards = user.user_cards
        card = user_cards.find{|userCard| userCard.card.id == params[:card_id].to_i}
        indeck = !card.indeck
        card.update(indeck: indeck)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "user_cards".* FROM "user_cards" WHERE "user_cards"."user_id" = ?  [["user_id", 6]]
UPDATE "user_cards" SET "indeck" = ?, "updated_at" = ? WHERE "user_cards"."id" = ?  [["indeck", 0], ["updated_at", "2021-03-01 06:04:49.723184"], ["id", 6]]